亲爱的玩家您请坐和放宽，本示例页面将告诉您 Inky V0.12 更新了哪些让人令人激动的特性 —— 与之前相比，Inky 几乎可以满足您对互动小说的要求了。

-> what

= what

 * 🎉 关于 Inky 编辑器改进
 
    🌌 核心已升级为 Ink V1.0；
    🌓 编辑器可切换为深色模式；
    🔮 编辑器文本大小支持缩放；
    🧩 菜单可快速插入语法模板；
    🧮 支持统计字数结点针脚等；
    🍩 大量 Bug 修复 ……
    
    
 * 🎨 可插入图像音频文件了
 
 # CLEAR
 
先插入一张图片试试，
 
 # IMAGE: https:\/\/i.loli.net/2021/03/05/5stb8Mo7VdRWZ1v.jpg
 
** 看啊，狼狼多可爱啊~

再来一张背景图片，

 # BACKGROUND: https:\/i.loli.net/2021/03/05/E43g1LebNFw8Aas.jpg
 
*** 这很适合狼狼居住~

我们再来点背景音乐，

 # BACKGROUND: https:\/\/i.loli.net/2021/03/06/sBNmtOL1vU8jTWk.jpg

**** 啊这（会有声音）

 # AUDIO: https:\/\/wolft.one/cello.wav

***** 狼不是这样叫的好吗？

实际上上还可以循环播放，不过估计你不会喜欢的。

* 💾 支持选择存档并读取了

点击右上角，你就可以存档并读取了。
点下 save ，让后大但的刷新下网页试试？

** 好的

看，你又回来了。也可以选择 load 随时回到这里。

* ->  

以上就是 Inky V0.12 的主要更新内容了，
接下来让我带您去项目下载页面看看~

** 好的
 # LINKOPEN: https:\/\/github.com/inkle/inky/releases/tag/0.12.0
 
 -> END


- -> what
